&НаСервере
Функция ПолучитьДанныеКлиента(телефон)
	
	НайденныйКлиент = Справочники.Клиенты.НайтиПоРеквизиту("НомерТелефона", телефон);
	
	КлСтрукт = Новый Структура("ФИО, Адрес, Почта", НайденныйКлиент.Наименование, НайденныйКлиент.Адрес, НайденныйКлиент.Почта);  
	
	Возврат КлСтрукт;
	
КонецФункции  


&НаСервере
Функция КлиентСуществует(номер)
	
	Если Справочники.Клиенты.НайтиПоРеквизиту("НомерТелефона",номер).НомерТелефона = номер тогда   
		
		Возврат Истина;   
		
	Иначе              
		
		Возврат Ложь;  
		
	КонецЕсли;	     
	
КонецФункции    


&НаСервере
Функция УслугиПриИзмененииНаСервере(услуга)  

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Цены.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.Цены КАК Цены
	|ГДЕ
	|	Цены.Услуга = &Ссылка";   
	
	Запрос.УстановитьПараметр("Ссылка",услуга); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		Цена = Выборка.Цена;
	КонецЦикла; 
	
	Возврат Цена;  
	
КонецФункции       


&НаСервере
Функция ДлительностьУслуги(услуга)
	Длительность = Справочники.Услуги.НайтиПоНаименованию(услуга).Длительность;
	Возврат Длительность; 
	
КонецФункции


&НаСервере
Функция ПоследняяЗаявкаБригады(Бригада, ДатаВыполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст ="
	|ВЫБРАТЬ
	|	ПриёмЗаявок.ДатаВыполнения КАК ДатаВыполнения,
	|	ПриёмЗаявок.ОбщаяДлительность КАК ОбщаяДлительность
	|ИЗ
	|	Документ.ПриёмЗаявок КАК ПриёмЗаявок
	|ГДЕ
	|	ПриёмЗаявок.Бригада = &Бригада
	|	И ПриёмЗаявок.ДатаВыполнения > &НачалоПериода
	|	И ПриёмЗаявок.ДатаВыполнения < &КонецПериода
	|УПОРЯДОЧИТЬ ПО
	|	ПриёмЗаявок.Дата ВОЗР";
	Запрос.УстановитьПараметр("Бригада", Бригада);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ДатаВыполнения));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаВыполнения));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Даты = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Даты.Добавить(Выборка.ДатаВыполнения);
		Даты.Добавить(Выборка.ОбщаяДлительность);
		
	КонецЦикла;
	
	Возврат Даты;

КонецФункции


&НаКлиенте
Процедура Заполнить(Команда)     
	
	Если Элементы.ЗаполнитьДанные.Доступность = Истина тогда
		
		ТЗ = ПолучитьДанныеКлиента(Объект.ТелефонКлиента);
		
		Объект.Клиент = ТЗ.ФИО;
		Объект.Адрес = ТЗ.Адрес;
		Объект.Почта = ТЗ.Почта;
		
	Иначе      
		
		Объект.Клиент = ""; 
		Объект.Адрес = "";
		Объект.Почта = "";
		                                                                             
		Предупреждение("Клиент не зарегистрирован, данные для заполнения отсутствуют");
		
	КонецЕсли;   
	
КонецПроцедуры   


&НаКлиенте
Процедура ТелефонКлиентаПриИзменении(Элемент)
		
	Если КлиентСуществует(Объект.ТелефонКлиента) тогда  
		
		Элементы.ЗаполнитьДанные.Доступность = Истина;
		Элементы.ТелефонКлиента.ЦветТекста = WebЦвета.Зеленый;  
		
	Иначе 
		
		Элементы.ЗаполнитьДанные.Доступность = Ложь;		
		Элементы.ТелефонКлиента.ЦветТекста = Новый Цвет(51,51,51);  
		
	КонецЕсли;   
	
КонецПроцедуры


&НаКлиенте
Процедура УслугиПриИзменении(Элемент)          
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;     
	
	СтрокаТабличнойЧасти.Цена = УслугиПриИзмененииНаСервере(СтрокаТабличнойЧасти.Услуги); 
	
	СтрокаТабличнойЧасти.Длительность = ДлительностьУслуги(СтрокаТабличнойЧасти.Услуги); 
	
	Объект.ОбщаяДлительность = Дата(1,1,1) + 1200;
	
	Для каждого СтрокаДокумента Из Объект.Услуги Цикл
		
		Объект.ОбщаяДлительность = Объект.ОбщаяДлительность + (СтрокаДокумента.Длительность - Дата(1,1,1));
		
	КонецЦикла;
	
	ПроверкаВремениРаботы();
	
КонецПроцедуры
	
	
&НаКлиенте
Процедура ПроверкаВремениРаботы()
	
	Объект.ДоступностьВыполнения = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ДатаВыполнения) И (ЗначениеЗаполнено(Объект.Бригада) И ЗначениеЗаполнено(Объект.Услуги)) тогда
		
		ПустаяДата = Дата(1,1,1);
		КонецЗадачиДокумента = ПустаяДата + (Объект.ДатаВыполнения - ПустаяДата) + (Объект.ОбщаяДлительность - ПустаяДата);

		
		Если Час(Объект.ДатаВыполнения) >= 9 И Час(КонецЗадачиДокумента) <= 20 тогда
						
			МассивДат = ПоследняяЗаявкаБригады(Объект.Бригада, Объект.ДатаВыполнения);
			
			ВремяСвободно = Ложь;
			
			Если МассивДат.Количество() = 0 тогда
				
				Объект.ДоступностьВыполнения = Истина;
				
			КонецЕсли;
			
			Если (МассивДат.Количество() = 2) тогда
				
				Если МассивДат[0] > КонецЗадачиДокумента тогда
					
					Объект.ДоступностьВыполнения = Истина;
					
				ИначеЕсли (ПустаяДата + (МассивДат[0] - ПустаяДата) + (МассивДат[1] - ПустаяДата)) < Объект.ДатаВыполнения тогда
					
					Объект.ДоступностьВыполнения = Истина;
					
				Иначе
					
					Объект.ДоступностьВыполнения = Ложь;
					
				КонецЕсли;
				
			Иначе
				
				Индекс = 0;                         
				Пока (Индекс < (МассивДат.Количество() - 2)) И (Объект.ДоступностьВыполнения = Ложь) цикл
					
					КонецЗадачиМассива = ПустаяДата + (МассивДат[Индекс] - ПустаяДата) + (МассивДат[Индекс + 1] - ПустаяДата);
					
					Если (Объект.ДатаВыполнения > КонецЗадачиМассива) И (МассивДат[Индекс + 2] > КонецЗадачиДокумента) тогда
						
						Объект.ДоступностьВыполнения = Истина;
						
					КонецЕсли;
					
					Индекс = Индекс + 2;
					
				КонецЦикла;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры
